; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v5 - type_3 ?v3 - type_1)
 	      (pred_3 ?v1 - object ?v3 - type_1)
	      (pred_2 ?v5 - type_3 ?v6 - type_2)
	      (pred_1 ?v5 - type_3 ?v1 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v5 - type_3 ?v2 ?v4 - type_1)
       :precondition (and  (pred_4 ?v5 ?v2))
       :effect (and  (pred_4 ?v5 ?v4)
		     (not (pred_4 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_3 ?v8 - object ?v7 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v7) (pred_4 ?v5 ?v7) (pred_2 ?v5 ?v6))
       :effect (and (pred_1 ?v5 ?v8 ?v6)
		    (not (pred_3 ?v8 ?v7)) 
		    (not (pred_2 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_3 ?v8 - object ?v7 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v8 ?v6) (pred_4 ?v5 ?v7))
       :effect (and (pred_3 ?v8 ?v7)
		    (pred_2 ?v5 ?v6)
		    (not (pred_1 ?v5 ?v8 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_05 - type_3
obj_10 obj_08 obj_11 obj_02 - type_2
obj_06 obj_12 obj_04 - type_1
obj_01 obj_07 obj_03 - object)
(:init
(pred_4 obj_09 obj_06)
(pred_2 obj_09 obj_10)
(pred_2 obj_09 obj_08)
(pred_4 obj_05 obj_06)
(pred_2 obj_05 obj_11)
(pred_2 obj_05 obj_02)
(pred_3 obj_01 obj_04)
(pred_3 obj_07 obj_12)
(pred_3 obj_03 obj_06)
)
(:goal
(and
(pred_3 obj_01 obj_06)
(pred_3 obj_07 obj_04)
(pred_3 obj_03 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_04)))
)
)

; plan
1. (op_2 obj_09 obj_03 obj_06 obj_08)
   deleted: (pred_3 obj_03 obj_06) (pred_2 obj_09 obj_08)
   added: (pred_1 obj_09 obj_03 obj_08)
   goals met: 0 of 3
2. (op_1 obj_05 obj_06 obj_04)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_04)
   goals met: 0 of 3
3. (op_1 obj_09 obj_06 obj_12)
   deleted: (pred_4 obj_09 obj_06)
   added: (pred_4 obj_09 obj_12)
   goals met: 0 of 3
4. (op_2 obj_05 obj_01 obj_04 obj_02)
   deleted: (pred_3 obj_01 obj_04) (pred_2 obj_05 obj_02)
   added: (pred_1 obj_05 obj_01 obj_02)
   goals met: 0 of 3
5. (op_3 obj_09 obj_03 obj_12 obj_08)
   deleted: (pred_1 obj_09 obj_03 obj_08)
   added: (pred_3 obj_03 obj_12) (pred_2 obj_09 obj_08)
   goals met: 1 of 3
6. (op_1 obj_05 obj_04 obj_06)
   deleted: (pred_4 obj_05 obj_04)
   added: (pred_4 obj_05 obj_06)
   goals met: 1 of 3
7. (op_2 obj_09 obj_07 obj_12 obj_08)
   deleted: (pred_3 obj_07 obj_12) (pred_2 obj_09 obj_08)
   added: (pred_1 obj_09 obj_07 obj_08)
   goals met: 1 of 3
8. (op_3 obj_05 obj_01 obj_06 obj_02)
   deleted: (pred_1 obj_05 obj_01 obj_02)
   added: (pred_3 obj_01 obj_06) (pred_2 obj_05 obj_02)
   goals met: 2 of 3
9. (op_1 obj_05 obj_06 obj_12)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_12)
   goals met: 2 of 3
10. (op_3 obj_09 obj_07 obj_12 obj_08)
   deleted: (pred_1 obj_09 obj_07 obj_08)
   added: (pred_3 obj_07 obj_12) (pred_2 obj_09 obj_08)
   goals met: 2 of 3
11. (op_2 obj_05 obj_07 obj_12 obj_02)
   deleted: (pred_3 obj_07 obj_12) (pred_2 obj_05 obj_02)
   added: (pred_1 obj_05 obj_07 obj_02)
   goals met: 2 of 3
12. (op_1 obj_05 obj_12 obj_04)
   deleted: (pred_4 obj_05 obj_12)
   added: (pred_4 obj_05 obj_04)
   goals met: 2 of 3
13. (op_3 obj_05 obj_07 obj_04 obj_02)
   deleted: (pred_1 obj_05 obj_07 obj_02)
   added: (pred_3 obj_07 obj_04) (pred_2 obj_05 obj_02)
   goals met: 3 of 3
